Ran Plan for dir: `.` workspace: `default`

<details><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # aws_iam_policy.secrets_manager_policy will be created
+ resource "aws_iam_policy" "secrets_manager_policy" {
+       arn              = (known after apply)
+       attachment_count = (known after apply)
+       description      = "Policy to access test-atlantis-secret secret"
+       id               = (known after apply)
+       name             = "test-atlantis-secret-access-policy"
+       name_prefix      = (known after apply)
+       path             = "/"
+       policy           = (known after apply)
+       policy_id        = (known after apply)
+       tags             = {
+           "Environment" = "test"
+           "ManagedBy"   = "terraform"
+           "Project"     = "atlantis-test"
        }
+       tags_all         = {
+           "Environment" = "test"
+           "ManagedBy"   = "terraform"
+           "Project"     = "atlantis-test"
        }
    }

  # aws_secretsmanager_secret.test_secret will be created
+ resource "aws_secretsmanager_secret" "test_secret" {
+       arn                            = (known after apply)
+       description                    = "Test secret created by Atlantis"
+       force_overwrite_replica_secret = false
+       id                             = (known after apply)
+       name                           = "test-atlantis-secret"
+       name_prefix                    = (known after apply)
+       policy                         = (known after apply)
+       recovery_window_in_days        = 7
+       tags                           = {
+           "Environment" = "test"
+           "ManagedBy"   = "terraform"
+           "Project"     = "atlantis-test"
        }
+       tags_all                       = {
+           "Environment" = "test"
+           "ManagedBy"   = "terraform"
+           "Project"     = "atlantis-test"
        }

+       replica (known after apply)
    }

  # aws_secretsmanager_secret_version.test_secret will be created
+ resource "aws_secretsmanager_secret_version" "test_secret" {
+       arn                  = (known after apply)
+       has_secret_string_wo = (known after apply)
+       id                   = (known after apply)
+       secret_id            = (known after apply)
+       secret_string        = (sensitive value)
+       secret_string_wo     = (write-only attribute)
+       version_id           = (known after apply)
+       version_stages       = (known after apply)
    }

  # random_password.secret_password will be created
+ resource "random_password" "secret_password" {
+       bcrypt_hash = (sensitive value)
+       id          = (known after apply)
+       length      = 17
+       lower       = true
+       min_lower   = 0
+       min_numeric = 0
+       min_special = 0
+       min_upper   = 0
+       number      = true
+       numeric     = true
+       result      = (sensitive value)
+       special     = true
+       upper       = true
    }

Plan: 4 to add, 0 to change, 0 to destroy.

Changes to Outputs:
+ iam_policy_arn    = (known after apply)
+ secret_arn        = (known after apply)
+ secret_id         = (known after apply)
+ secret_name       = "test-atlantis-secret"
+ secret_version_id = (known after apply)
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -d .
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](https://ex-github-complete.hqkhiem.online/lock?id=hqkhiem%252Ftest-atlantis%252F.%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -d .
  ```
Plan: 4 to add, 0 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this Pull Request, comment:
  ```shell
  atlantis apply
  ```
* :put_litter_in_its_place: To **delete** all plans and locks from this Pull Request, comment:
  ```shell
  atlantis unlock
  ```